app/controllers/coins_controller.rb

SELECT "coins".* FROM "coins"
---
  def index
    @coins = Coin.all

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", ""], ["created_at", "2022-05-23 14:51:40.782371"], ["updated_at", "2022-05-23 14:51:40.782371"]]
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_coin
      @coin = Coin.find(params[:id])